{"duration": 7.2113847732543945, "input_args": {"transformer": "TfidfVectorizer(analyzer='word', binary=False, decode_error='strict',\n        dtype=<class 'numpy.int64'>, encoding='utf-8', input='content',\n        lowercase=True, max_df=1.0, max_features=None, min_df=4,\n        ngram_range=(1, 2), norm='l2', preprocessor=None, smooth_idf=True,\n        stop_words=None, strip_accents=None, sublinear_tf=False,\n        token_pattern='(?u)\\\\b\\\\w\\\\w+\\\\b', tokenizer=None, use_idf=True,\n        vocabulary=None)", "weight": "None", "X": "0        Beautiful unique dress Wore this to my sons we...\n1        Had high hopes but... Gals, if you absolutely ...\n2        Buttons -buttons so cute! I hardly believe i h...\n3        Love this dress This dress is so cute and comf...\n4        Perfect summer pants! The linen- cotton blend ...\n5        Too bulky I like the quality of material of th...\n6        Love it Great top. i got the size 4 but i orde...\n7        Beautiful drape, very deep v I bought this yes...\n9        Awkward length in front It seems like most peo...\n10       Gorgeous color I tried this on in my usual siz...\n11       Closet essential A great white blouse! i expec...\n14       Beautiful fall sweater This top is really cute...\n15       Runs large I so wanted to love this tank, and ...\n16       Pretty from far away, but... As soon as you ge...\n17       An original! I saw this dress on the cashier a...\n18       Great classic skirt This skirt is great, a cla...\n19       A new wardrobe staple! Love this sweater! i pu...\n22       Favorite pant---until they ripped As a tall gi...\n23       Soft Love bailey 44. this dress does not disap...\n24       Love it Love it, super cute, super comfortable...\n25       Darling top! Love this top! such a fun pattern...\n26       Beautiful light and versatile I love this dres...\n27       Gorgeous dress Online this dress caught my eye...\n28       Busty petites rejoice (1) This dress is lovely...\n29       Another winner Can't go wrong with these new c...\n30       Great leggings! I'm extremely pleased with the...\n31       Awesome dress! I got this when it went on sale...\n32       Love it! I saw this in the store, not on sale ...\n33       Small in bust, tts in torso This top is a toug...\n34       Cute and comfortable I just received this dres...\n                               ...                        \n17580    Love retailer bathing suits! Perfect fit and i...\n17581    Cute I agree with others that the shape is not...\n17582    Big and boxy As previously mentioned, this dre...\n17583    Do love it, however: Tried the xs on in store ...\n17584    Modern,oversized men's wear meets utilitarian ...\n17585    Coral roll top sweater. This sweater is thick ...\n17586    Love this tee! I love everything about this te...\n17587    Beautiful colors I loved this dress and i real...\n17588    Great shirt! I bought this top about 3 weeks a...\n17589    Perfect summer dress Good quality; casual feel...\n17591    Very retro This top reminds me of something ou...\n17592    Comfy and stylish I love these pants. they are...\n17593    Please make more pants like these! These pants...\n17594    Great color and design! This is a beautiful dr...\n17595    Way better in person This is a must have! way ...\n17596    Soft, nice details Soft fabric. great color fo...\n17598    Better than i expected!! These are colors i no...\n17599    Great in photo... not so much on This dress lo...\n17600    Shrunk terribly I was so excited to find this ...\n17601    Way too big After reading the previous reviews...\n17602    Its a keeper I'm not usually a fan of simple c...\n17603    So soft and beautiful This top runs a tad big....\n17604    Perfect shirt for all occasions I absolutely l...\n17605    Cute buttondown; runs large Looks great with s...\n17606    Could have been better... I grabbed my typical...\n17608    Petite busty girls rejoice 2 I loved this but ...\n17609    Interesting Love the block appearance. looks e...\n17610    Perfect casual dress! This dress is perfect fo...\n17612    So pleased I bought this sweater on a whim in ...\n17613    Beautiful, flowy, I fell in love with this shi...\nLength: 14762, dtype: object", "y": "0        1\n1        0\n2        1\n3        1\n4        1\n5        0\n6        1\n7        1\n9        0\n10       1\n11       1\n14       1\n15       0\n16       0\n17       1\n18       1\n19       1\n22       0\n23       1\n24       1\n25       1\n26       1\n27       1\n28       1\n29       1\n30       1\n31       1\n32       1\n33       1\n34       1\n        ..\n17580    1\n17581    1\n17582    0\n17583    1\n17584    1\n17585    0\n17586    1\n17587    1\n17588    1\n17589    1\n17591    1\n17592    1\n17593    1\n17594    1\n17595    1\n17596    1\n17598    1\n17599    0\n17600    0\n17601    0\n17602    1\n17603    1\n17604    1\n17605    1\n17606    0\n17608    1\n17609    1\n17610    1\n17612    1\n17613    1\nName: Recommended, Length: 14762, dtype: int64", "**": "{}"}}