{"duration": 1.7923879623413086, "input_args": {"transformer": "TfidfVectorizer(analyzer='word', binary=False, decode_error='strict',\n        dtype=<class 'numpy.int64'>, encoding='utf-8', input='content',\n        lowercase=True, max_df=1.0, max_features=None, min_df=1,\n        ngram_range=(1, 1), norm='l2', preprocessor=None, smooth_idf=True,\n        stop_words=None, strip_accents=None, sublinear_tf=False,\n        token_pattern='(?u)\\\\b\\\\w\\\\w+\\\\b', tokenizer=None, use_idf=True,\n        vocabulary=None)", "weight": "None", "X": "0        Beautiful unique dress Wore this to my sons we...\n1        Had high hopes but... Gals, if you absolutely ...\n2        Buttons -buttons so cute! I hardly believe i h...\n3        Love this dress This dress is so cute and comf...\n4        Perfect summer pants! The linen- cotton blend ...\n5        Too bulky I like the quality of material of th...\n6        Love it Great top. i got the size 4 but i orde...\n7        Beautiful drape, very deep v I bought this yes...\n9        Awkward length in front It seems like most peo...\n10       Gorgeous color I tried this on in my usual siz...\n11       Closet essential A great white blouse! i expec...\n14       Beautiful fall sweater This top is really cute...\n15       Runs large I so wanted to love this tank, and ...\n16       Pretty from far away, but... As soon as you ge...\n17       An original! I saw this dress on the cashier a...\n18       Great classic skirt This skirt is great, a cla...\n19       A new wardrobe staple! Love this sweater! i pu...\n22       Favorite pant---until they ripped As a tall gi...\n23       Soft Love bailey 44. this dress does not disap...\n24       Love it Love it, super cute, super comfortable...\n25       Darling top! Love this top! such a fun pattern...\n26       Beautiful light and versatile I love this dres...\n27       Gorgeous dress Online this dress caught my eye...\n28       Busty petites rejoice (1) This dress is lovely...\n29       Another winner Can't go wrong with these new c...\n30       Great leggings! I'm extremely pleased with the...\n31       Awesome dress! I got this when it went on sale...\n32       Love it! I saw this in the store, not on sale ...\n33       Small in bust, tts in torso This top is a toug...\n34       Cute and comfortable I just received this dres...\n                               ...                        \n14128    Waist is higher than my waist I ordered this d...\n14133    Adorable design. sizing off Adorable fall dres...\n14134    Loose and unflattering I'm normally a small in...\n14148    Runs really large I really liked the design. o...\n14155    It's a tent! As much as i buy from retailer, t...\n14160    Disappointing This skirt is definitely not wha...\n14163    Not sure I love the colors of this top. it doe...\n14164    Wish i could keep I wish i could keep this dre...\n14165    Pilcro has gone so down in quality Pilcro jean...\n14172    Poor quality I like the design of the dress, b...\n14173    Great price (on sale) but sheds too much! Love...\n14176    Look like \"mom jeans\" Maybe i just have the wr...\n14177    Beware of the mint striped pattern I have this...\n14181    Just odd I am absolutely shocked that so many ...\n14182    Not the right color I ordered these twice just...\n14187    Nice design but poorly executed I was really e...\n14188    Fabric too delicate I bought this shirt in 3 c...\n14194    I tried, but odd fit The print and fabric are ...\n14196    Not great If you're tall, this dress sits up t...\n14201    Not a rich style... The fabric and its texture...\n14203    Shapeless In the words of my husband, \"looks l...\n14207    Very poor quality I ordered this top in white ...\n14208    Frumpy Love the color, but the fit is just odd...\n14209    Excellent if you do not have a chest I receive...\n14216    Not the best quality I got this dress in hopes...\n14218    Primula cocoon cardi This is huge. i understan...\n14227    Incredibly unflattering I ordered this in blue...\n14228    Nothing like the picture! I thought this was m...\n14230    Nice design but quality isses I tried this jac...\n14236    Too much fabric in the wrong places! Usually i...\nLength: 11811, dtype: object", "y": "0        1\n1        0\n2        1\n3        1\n4        1\n5        0\n6        1\n7        1\n9        0\n10       1\n11       1\n14       1\n15       0\n16       0\n17       1\n18       1\n19       1\n22       0\n23       1\n24       1\n25       1\n26       1\n27       1\n28       1\n29       1\n30       1\n31       1\n32       1\n33       1\n34       1\n        ..\n14128    0\n14133    0\n14134    0\n14148    0\n14155    0\n14160    0\n14163    0\n14164    0\n14165    0\n14172    0\n14173    0\n14176    0\n14177    0\n14181    0\n14182    0\n14187    0\n14188    0\n14194    0\n14196    0\n14201    0\n14203    0\n14207    0\n14208    0\n14209    0\n14216    0\n14218    0\n14227    0\n14228    0\n14230    0\n14236    0\nName: Recommended, Length: 11811, dtype: int64", "**": "{}"}}