{"duration": 4.546022891998291, "input_args": {"transformer": "TfidfVectorizer(analyzer='word', binary=False, decode_error='strict',\n        dtype=<class 'numpy.int64'>, encoding='utf-8', input='content',\n        lowercase=True, max_df=1.0, max_features=None, min_df=4,\n        ngram_range=(1, 2), norm='l2', preprocessor=None, smooth_idf=True,\n        stop_words=None, strip_accents=None, sublinear_tf=False,\n        token_pattern='(?u)\\\\b\\\\w\\\\w+\\\\b', tokenizer=None, use_idf=True,\n        vocabulary=None)", "weight": "None", "X": "0        Beautiful unique dress Wore this to my sons we...\n1        Had high hopes but... Gals, if you absolutely ...\n2        Buttons -buttons so cute! I hardly believe i h...\n3        Love this dress This dress is so cute and comf...\n4        Perfect summer pants! The linen- cotton blend ...\n5        Too bulky I like the quality of material of th...\n6        Love it Great top. i got the size 4 but i orde...\n7        Beautiful drape, very deep v I bought this yes...\n9        Awkward length in front It seems like most peo...\n10       Gorgeous color I tried this on in my usual siz...\n11       Closet essential A great white blouse! i expec...\n14       Beautiful fall sweater This top is really cute...\n15       Runs large I so wanted to love this tank, and ...\n16       Pretty from far away, but... As soon as you ge...\n17       An original! I saw this dress on the cashier a...\n18       Great classic skirt This skirt is great, a cla...\n19       A new wardrobe staple! Love this sweater! i pu...\n22       Favorite pant---until they ripped As a tall gi...\n23       Soft Love bailey 44. this dress does not disap...\n24       Love it Love it, super cute, super comfortable...\n25       Darling top! Love this top! such a fun pattern...\n26       Beautiful light and versatile I love this dres...\n27       Gorgeous dress Online this dress caught my eye...\n28       Busty petites rejoice (1) This dress is lovely...\n29       Another winner Can't go wrong with these new c...\n30       Great leggings! I'm extremely pleased with the...\n31       Awesome dress! I got this when it went on sale...\n32       Love it! I saw this in the store, not on sale ...\n33       Small in bust, tts in torso This top is a toug...\n34       Cute and comfortable I just received this dres...\n                               ...                        \n11734    Beautiful in blue! I totally love this tank! t...\n11735    Gorgeous I bought this on a whim, and i love i...\n11736    Bummer Oh, i wanted this dress to work! i boug...\n11737    Shrank! This is a very cute dress. it was perf...\n11738    Blue green This top is beautiful.  at the pres...\n11739    Wanted to love this skirt I was so curious to ...\n11740    Quirky Nice top; the material is soft and drap...\n11741    Sweater time I have not worn yet but excited t...\n11743    Did not like the fit, but beautiful colors I r...\n11745    Lovely but not quite right I definitely think ...\n11746              Great dress! Great dress for vacations!\n11747    Love this! This shirt is comfortable, loose, b...\n11748    Not a flattering fit The shirt does have a wei...\n11749    Cute top. sizing not correct. I just purchased...\n11750    Versatile top This top is beautiful and fits t...\n11751    The print is a work of art - i love this dress...\n11752    Too cropped As others have said, this is cropp...\n11754    Cute in coral I love it! it's cute and short a...\n11755    Tunic I loved the look of this tunic. it is ma...\n11756    Didn't look good on me Thought i would try thi...\n11757    A classic piece! This dress is beautiful! the ...\n11766    Cute dress but runs large! I wanted to love th...\n11767    Thin, boxy I bought this shirt after reading s...\n11770    Shirtdress I ordered the large since the med w...\n11791    Lovely color This sweater is a lovely color an...\n11795    Gorgeous color - weird fit! I liked this dress...\n11806    Runs small, too much distressing I have a few ...\n11808    A colorful big box Since this sold out so fast...\n11810    Tight sleeves Seems there was a design defect ...\n11813    Perfect, for the first month of wear These wer...\nLength: 9842, dtype: object", "y": "0        1\n1        0\n2        1\n3        1\n4        1\n5        0\n6        1\n7        1\n9        0\n10       1\n11       1\n14       1\n15       0\n16       0\n17       1\n18       1\n19       1\n22       0\n23       1\n24       1\n25       1\n26       1\n27       1\n28       1\n29       1\n30       1\n31       1\n32       1\n33       1\n34       1\n        ..\n11734    1\n11735    1\n11736    0\n11737    0\n11738    1\n11739    0\n11740    1\n11741    1\n11743    0\n11745    1\n11746    1\n11747    1\n11748    0\n11749    1\n11750    1\n11751    1\n11752    0\n11754    1\n11755    1\n11756    0\n11757    1\n11766    0\n11767    0\n11770    0\n11791    0\n11795    0\n11806    0\n11808    0\n11810    0\n11813    0\nName: Recommended, Length: 9842, dtype: int64", "**": "{}"}}