{"duration": 4.708444118499756, "input_args": {"transformer": "TfidfVectorizer(analyzer='word', binary=False, decode_error='strict',\n        dtype=<class 'numpy.int64'>, encoding='utf-8', input='content',\n        lowercase=True, max_df=1.0, max_features=None, min_df=4,\n        ngram_range=(1, 2), norm='l2', preprocessor=None, smooth_idf=True,\n        stop_words=None, strip_accents=None, sublinear_tf=False,\n        token_pattern='(?u)\\\\b\\\\w\\\\w+\\\\b', tokenizer=None, use_idf=True,\n        vocabulary=None)", "weight": "None", "X": "5761     Too much gathering over bust-sticks out an inc...\n5768     So beautiful but impossible Gorgeous dress, bu...\n5777     Beautiful dress, odd fit I really wanted to lo...\n5784     Runs small and short- why no size 16? The skir...\n5791     Big and boxy This sweater is big and box. it l...\n5797     Disappointing I was expecting a tunic with a b...\n5804     Stain on shirt I was very disappointed with my...\n5806     Really poor quality This shirt is purportedly ...\n5823     Wanted to love it Unfortunately, this sweater ...\n5828     Odd sleeves? Designs are nice and texture feel...\n5834     Boxy and billowy Ordered this in xl- i usually...\n5847     Nothing special I was excited to receive in ho...\n5852     Way too large everywhere I ordered a medium in...\n5853     Tent-like but cozy I tried this on in the stor...\n5868     Colors look nothing like online photos:( When ...\n5881     Grandmas draperies dress I had to review this ...\n5892     Discolored after one wash. Similar to others h...\n5899     Maternity blouse I was planning on wearing thi...\n5900     Poor design If you have anything larger than a...\n5905     Cute and comfy These are very versatile pants....\n5906     Order up a size! After reading the reviews abo...\n5907     Not for the large busted I was so excited when...\n5908     Red \"evanthe\" dress Agreed with the previous r...\n5909     Awesome summer dress Dress just arrived and i ...\n5910     Comfy, long jersey tunic I love most pure and ...\n5911     Too much fabric Alas, i so wanted to love this...\n5912     In love I am a little retailer obsessed and ha...\n5914     Weird fit I loved the look of this blouse onli...\n5915     High quality, on trend I love this tunic! it r...\n5916     Adorable! Love this top! bought it in the reli...\n                               ...                        \n17580    Love retailer bathing suits! Perfect fit and i...\n17581    Cute I agree with others that the shape is not...\n17582    Big and boxy As previously mentioned, this dre...\n17583    Do love it, however: Tried the xs on in store ...\n17584    Modern,oversized men's wear meets utilitarian ...\n17585    Coral roll top sweater. This sweater is thick ...\n17586    Love this tee! I love everything about this te...\n17587    Beautiful colors I loved this dress and i real...\n17588    Great shirt! I bought this top about 3 weeks a...\n17589    Perfect summer dress Good quality; casual feel...\n17591    Very retro This top reminds me of something ou...\n17592    Comfy and stylish I love these pants. they are...\n17593    Please make more pants like these! These pants...\n17594    Great color and design! This is a beautiful dr...\n17595    Way better in person This is a must have! way ...\n17596    Soft, nice details Soft fabric. great color fo...\n17598    Better than i expected!! These are colors i no...\n17599    Great in photo... not so much on This dress lo...\n17600    Shrunk terribly I was so excited to find this ...\n17601    Way too big After reading the previous reviews...\n17602    Its a keeper I'm not usually a fan of simple c...\n17603    So soft and beautiful This top runs a tad big....\n17604    Perfect shirt for all occasions I absolutely l...\n17605    Cute buttondown; runs large Looks great with s...\n17606    Could have been better... I grabbed my typical...\n17608    Petite busty girls rejoice 2 I loved this but ...\n17609    Interesting Love the block appearance. looks e...\n17610    Perfect casual dress! This dress is perfect fo...\n17612    So pleased I bought this sweater on a whim in ...\n17613    Beautiful, flowy, I fell in love with this shi...\nLength: 9840, dtype: object", "y": "5761     0\n5768     0\n5777     0\n5784     0\n5791     0\n5797     0\n5804     0\n5806     0\n5823     0\n5828     0\n5834     0\n5847     0\n5852     0\n5853     0\n5868     0\n5881     0\n5892     0\n5899     0\n5900     0\n5905     1\n5906     1\n5907     0\n5908     1\n5909     1\n5910     1\n5911     0\n5912     1\n5914     0\n5915     1\n5916     1\n        ..\n17580    1\n17581    1\n17582    0\n17583    1\n17584    1\n17585    0\n17586    1\n17587    1\n17588    1\n17589    1\n17591    1\n17592    1\n17593    1\n17594    1\n17595    1\n17596    1\n17598    1\n17599    0\n17600    0\n17601    0\n17602    1\n17603    1\n17604    1\n17605    1\n17606    0\n17608    1\n17609    1\n17610    1\n17612    1\n17613    1\nName: Recommended, Length: 9840, dtype: int64", "**": "{}"}}