{"duration": 1.6965670585632324, "input_args": {"transformer": "TfidfVectorizer(analyzer='word', binary=False, decode_error='strict',\n        dtype=<class 'numpy.int64'>, encoding='utf-8', input='content',\n        lowercase=True, max_df=1.0, max_features=None, min_df=1,\n        ngram_range=(1, 1), norm='l2', preprocessor=None, smooth_idf=True,\n        stop_words=None, strip_accents=None, sublinear_tf=False,\n        token_pattern='(?u)\\\\b\\\\w\\\\w+\\\\b', tokenizer=None, use_idf=True,\n        vocabulary=None)", "weight": "None", "X": "3458     Awkward to wear This dress is beautiful, made ...\n3462     Disappointed I also expected this sweater to h...\n3474     Nothing to rave about This sweater is ok. i lo...\n3485     Close but not quite right I was looking for an...\n3513     Armholes too large With a rather large chest, ...\n3514     Horrible zipper beautiful dress I'll start by ...\n3518     Petite frames will love this! The shirt is bea...\n3519     Good luck getting it on! You have to be a cont...\n3533     Good if you're taller I wanted to like this an...\n3544     Great stretch I ordered these jeans in size 30...\n3545     For the woman who is vibrant and dynamic I bou...\n3546     Cute shoulders and pretty color I bought the m...\n3547     This dress is adorable!! This dress is so cute...\n3548     This dress is so classic! I fell in love with ...\n3549     Beautiful color, pretty design, nice fabric I ...\n3550     Amazing! Love this sweater! not too long or bu...\n3551     Cute for a straight figure This looks great on...\n3553     So comfortable! I love this top. it is perfect...\n3554     Fantastic &  fun I saw this top online and fel...\n3555     Great versatile dress This is a great dress fo...\n3556     Nice dress but could be better I purchased thi...\n3557     Wonderfully soft jacket Love the asymmetrical ...\n3558     Retro awesomeness Super comfortable and cute!!...\n3559     So comfy! This is going to be my go-to winter ...\n3560     Perfect fall shirt Comfortable and soft are tw...\n3561     So cute! I love this! seriously would buy agai...\n3562     Not for me but seemed like good quality The ro...\n3563     Not what i expected The description doesn't in...\n3564     Runs big Cute tank, runs big. i purchased the ...\n3565     Great design but execution is meh..... I loved...\n                               ...                        \n17580    Love retailer bathing suits! Perfect fit and i...\n17581    Cute I agree with others that the shape is not...\n17582    Big and boxy As previously mentioned, this dre...\n17583    Do love it, however: Tried the xs on in store ...\n17584    Modern,oversized men's wear meets utilitarian ...\n17585    Coral roll top sweater. This sweater is thick ...\n17586    Love this tee! I love everything about this te...\n17587    Beautiful colors I loved this dress and i real...\n17588    Great shirt! I bought this top about 3 weeks a...\n17589    Perfect summer dress Good quality; casual feel...\n17591    Very retro This top reminds me of something ou...\n17592    Comfy and stylish I love these pants. they are...\n17593    Please make more pants like these! These pants...\n17594    Great color and design! This is a beautiful dr...\n17595    Way better in person This is a must have! way ...\n17596    Soft, nice details Soft fabric. great color fo...\n17598    Better than i expected!! These are colors i no...\n17599    Great in photo... not so much on This dress lo...\n17600    Shrunk terribly I was so excited to find this ...\n17601    Way too big After reading the previous reviews...\n17602    Its a keeper I'm not usually a fan of simple c...\n17603    So soft and beautiful This top runs a tad big....\n17604    Perfect shirt for all occasions I absolutely l...\n17605    Cute buttondown; runs large Looks great with s...\n17606    Could have been better... I grabbed my typical...\n17608    Petite busty girls rejoice 2 I loved this but ...\n17609    Interesting Love the block appearance. looks e...\n17610    Perfect casual dress! This dress is perfect fo...\n17612    So pleased I bought this sweater on a whim in ...\n17613    Beautiful, flowy, I fell in love with this shi...\nLength: 11809, dtype: object", "y": "3458     0\n3462     0\n3474     0\n3485     0\n3513     0\n3514     0\n3518     0\n3519     0\n3533     0\n3544     1\n3545     1\n3546     1\n3547     1\n3548     1\n3549     1\n3550     1\n3551     0\n3553     1\n3554     1\n3555     1\n3556     1\n3557     1\n3558     1\n3559     1\n3560     1\n3561     1\n3562     1\n3563     1\n3564     1\n3565     0\n        ..\n17580    1\n17581    1\n17582    0\n17583    1\n17584    1\n17585    0\n17586    1\n17587    1\n17588    1\n17589    1\n17591    1\n17592    1\n17593    1\n17594    1\n17595    1\n17596    1\n17598    1\n17599    0\n17600    0\n17601    0\n17602    1\n17603    1\n17604    1\n17605    1\n17606    0\n17608    1\n17609    1\n17610    1\n17612    1\n17613    1\nName: Recommended, Length: 11809, dtype: int64", "**": "{}"}}